<div align="right" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/Logo blue_dark.png"  style="width:25px" align="right";/>
</div>

# Intro to the Third Normal Form – 3NF
© ExploreAI Academy

In this train, we will delve into the concept of transitive dependencies within the context of the Third Normal Form (3NF). Our focus will be on dissecting the tables within the `dam_levels` database, importing data, and establishing suitable relationships, ultimately leading to the creation of a database structure that adheres to 3NF principles.

> ⚠️ This exercise extends the concepts introduced in the previous one, **Intro to the Second Normal Form – 2NF**. Therefore, it's important to ensure that you continue using the modified `dam_levels.db` database after successfully completing the previous exercise.
 
> ⚠️ Since the queries here will modify the database, you will have to get a fresh copy to redo the code cells.

## Learning objectives

By the end of this train, you should:
- Understand the requirements for achieving the Third Normal Form (3NF) in database normalisation, including the elimination of transitive dependencies.
- Learn to assess and identify transitive dependencies within a database table.

## Overview

To get the tables in 3NF, we need to ensure the following:

- The tables are in 2NF.
- All **transitive dependencies** should be removed – for 3NF, non-key fields must provide a fact about the key, the whole key, and nothing but the key. Anything else should be placed in a separate table.

<div>
Let's look at normalising the 2NF dams database containing information about Cape Town dam water levels leading up to the 2018 Cape Town water crisis.
</div>

## Connecting to the database

In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook. 
# If you get an error here, make sure that mysql and pymysql are installed correctly. 

%load_ext sql

In [2]:
# Load SQLite database
%sql sqlite:///../db/dam_levels.db

Before we proceed, let's first take a look at the `assessments` table.

In [3]:
%%sql

SELECT 
    * 
FROM 
    assessments
LIMIT 10; -- Remove this line to see the full query output

 * sqlite:///../db/dam_levels.db
Done.

[(1, 2012, 'P. M. Naidoo', 201013, 48.2),
 (2, 2012, 'A. T. Sijovu', 202256, 15),
 (3, 2012, 'P. M. Naidoo', 201013, 14.2),
 (4, 2012, 'A. T. Sijovu', 202256, 35.3),
 (5, 2013, 'P. M. Naidoo', 201013, 53.3),
 (6, 2013, 'A. T. Sijovu', 202256, 16.6),
 (7, 2013, 'P. M. Naidoo', 201013, 15.2),
 (8, 2013, 'A. T. Sijovu', 202256, 35.9),
 (9, 2015, 'P. M. Naidoo', 201013, 47.5),
 (10, 2015, 'A. T. Sijovu', 202256, 11.9)]

Evidently, the `year`, `water_level`, and `Assessment_Officer` columns provide a fact about the key (i.e. `AssessmentId`). However, the `Officer_Reg` column only provides information about the `Assessment_Officer` column.

## Exercise

### Exercise 1

Break down the `assessments` table and place all officers in their own separate table. To do this, create a `water_level_assessments` table.

In [8]:
%%sql
CREATE TABLE IF NOT EXISTS water_level_assessments
(AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
year INT,
Officer_Reg INT(10,1),
water_level INT)

 * sqlite:///../db/dam_levels.db
Done.

[]

### Exercise 2
Copy the relevant data into the `water_level_assessments` table.

In [11]:
%%sql
INSERT INTO water_level_assessments
SELECT AssessmentID, year, Officer_Reg, water_level
FROM assessments

 * sqlite:///../db/dam_levels.db
18 rows affected.

[]

### Exercise 3

Create an `officers` table that will contain the officer data which we removed from the `assessments` table.

In [12]:
%%sql 

CREATE TABLE IF NOT EXISTS officers (
    Officer_Reg INTEGER PRIMARY KEY,
    Officer_Name VARCHAR(100)    
);

 * sqlite:///../db/dam_levels.db
Done.

[]

### Exercise 4

Add the relevant data into the `officers` table.

In [17]:
%%sql
INSERT INTO officers
SELECT Officer_Reg, Assessment_Officer
From assessments
GROUP BY Officer_Reg

 * sqlite:///../db/dam_levels.db
3 rows affected.

[]

### Exercise 5

Delete the old `assessments` table.

In [18]:
%%sql

DROP table IF EXISTS assessments;

 * sqlite:///../db/dam_levels.db
Done.

[]

## Solutions

### Exercise 1

In [ ]:
%%sql 

CREATE TABLE water_level_assessments (
    AssessmentId INTEGER PRIMARY KEY AUTOINCREMENT,
    year INTEGER,
    Officer_Reg INTEGER,
    water_level NUMERIC(10,1)
);

The `Officer_Reg` field has been kept within our table instead of `Assessment_Officer`. This is because the `Officer_Reg` field will need to serve as a foreign key to a new table we create which will contain all our officer information. Foreign keys are also the primary keys within their respective home tables, and as such need to be unique. In this way, we could have used `Assessment_Officer` as our linking field (foreign key), but we would then run the risk of having two officers with the same name (our key is non-unique), making our linking relationship invalid.

### Exercise 2

In [ ]:
%%sql

INSERT INTO 
    water_level_assessments(
            AssessmentId, 
            year, 
            Officer_Reg, 
            water_level
        )
SELECT 
    AssessmentId, 
    year, 
    Officer_Reg, 
    water_level
FROM 
    assessments
ORDER BY year;

### Exercise 3

In [ ]:
%%sql 

CREATE TABLE officers (
    Officer_Reg INTEGER PRIMARY KEY,
    Officer_Name VARCHAR(100)    
);

### Exercise 4

In [ ]:
%%sql

INSERT INTO 
    officers(
            Officer_Name,
            Officer_Reg
        )
SELECT 
    Assessment_Officer,
    Officer_Reg
FROM 
    assessments
GROUP BY Assessment_Officer;

### Exercise 5

In [ ]:
%%sql

DROP table assessments;

## Summary

With that, we have transformed a table from being unnormalised to the Third Normal Form! 

We started with a single `dam_levels` table and ended up with four separate tables, i.e.:
|name|
---
dam_assessments
dams
officers
water_level_assessments

These tables are in 3NF and linked together in a logical way that helps to reduce data anomalies. Although higher levels of normalisation exist, 3NF is sufficient for most business applications.

#  

<div align="center" style=" font-size: 80%; text-align: center; margin: 0 auto">
<img src="https://raw.githubusercontent.com/Explore-AI/Pictures/master/ExploreAI_logos/EAI_Blue_Dark.png"  style="width:200px";/>
</div>